In [ ]:
i=1
while i<10:
  print(i)
  if i==3:
    break
  i+=1

1
2
3

In [ ]:
i=0
while i<10:
  i+=1
  if i==3:
    continue
  print(i)

1
2
4
5
6
7
8
9
10

In [ ]:
import pandas as x

In [ ]:
df=x.read_excel("Sample.xlsx")

In [ ]:
df

      Days  Apple  Banana  Rice  Biscuits  Chips
0    Day 1     52      95    97        29     42
1    Day 2     53      30    22        75     10
2    Day 3     43      42    77         3     91
3    Day 4     56      32    17        73     66
4    Day 5     62       8    45        21     61
5    Day 6     38      34    65        89     37
6    Day 7     19      11    38        45     38
7    Day 8     26      29    16        77     43
8    Day 9     23      68    64        60     36
9   Day 10     74      86    41        41     73
10  Day 11     69      67    45        36     41
11  Day 12     34      12    21        97     92
12  Day 13     64      62     1        97     26
13  Day 14     64       1    42        77     84
14  Day 15     66      21    80        44     21
15  Day 16     57      14    40        11     36
16  Day 17     95      40    38        85     76
17  Day 18     63      29    28        38     29
18  Day 19     72      47    44        32     68
19  Day 20     76      51    59        93     32

In [ ]:
df.head()

    Days  Apple  Banana  Rice  Biscuits  Chips
0  Day 1     52      95    97        29     42
1  Day 2     53      30    22        75     10
2  Day 3     43      42    77         3     91
3  Day 4     56      32    17        73     66
4  Day 5     62       8    45        21     61

In [ ]:
df.tail()

      Days  Apple  Banana  Rice  Biscuits  Chips
15  Day 16     57      14    40        11     36
16  Day 17     95      40    38        85     76
17  Day 18     63      29    28        38     29
18  Day 19     72      47    44        32     68
19  Day 20     76      51    59        93     32

In [ ]:
df.describe()

           Apple     Banana       Rice   Biscuits      Chips
count  20.000000  20.000000  20.000000  20.000000  20.000000
mean   55.300000  38.950000  44.000000  56.150000  50.100000
std    19.647151  26.095926  24.054762  29.723772  24.265852
min    19.000000   1.000000   1.000000   3.000000  10.000000
25%    41.750000  19.250000  26.500000  35.000000  35.000000
50%    59.500000  33.000000  41.500000  52.500000  41.500000
75%    66.750000  53.750000  60.250000  79.000000  69.250000
max    95.000000  95.000000  97.000000  97.000000  92.000000

In [ ]:
df.Apple

0     52
1     53
2     43
3     56
4     62
5     38
6     19
7     26
8     23
9     74
10    69
11    34
12    64
13    64
14    66
15    57
16    95
17    63
18    72
19    76
Name: Apple, dtype: int64

In [ ]:
df.Banana

0     95
1     30
2     42
3     32
4      8
5     34
6     11
7     29
8     68
9     86
10    67
11    12
12    62
13     1
14    21
15    14
16    40
17    29
18    47
19    51
Name: Banana, dtype: int64

In [ ]:
df.Rice

0     97
1     22
2     77
3     17
4     45
5     65
6     38
7     16
8     64
9     41
10    45
11    21
12     1
13    42
14    80
15    40
16    38
17    28
18    44
19    59
Name: Rice, dtype: int64

In [ ]:
df.Biscuits

0     29
1     75
2      3
3     73
4     21
5     89
6     45
7     77
8     60
9     41
10    36
11    97
12    97
13    77
14    44
15    11
16    85
17    38
18    32
19    93
Name: Biscuits, dtype: int64

In [ ]:
df.Chips

0     42
1     10
2     91
3     66
4     61
5     37
6     38
7     43
8     36
9     73
10    41
11    92
12    26
13    84
14    21
15    36
16    76
17    29
18    68
19    32
Name: Chips, dtype: int64

In [ ]:
df["Apple"]

0     52
1     53
2     43
3     56
4     62
5     38
6     19
7     26
8     23
9     74
10    69
11    34
12    64
13    64
14    66
15    57
16    95
17    63
18    72
19    76
Name: Apple, dtype: int64

In [ ]:
df.loc[0]

Days        Day 1
Apple          52
Banana         95
Rice           97
Biscuits       29
Chips          42
Name: 0, dtype: object

In [ ]:
df.loc[3]

Days        Day 4
Apple          56
Banana         32
Rice           17
Biscuits       73
Chips          66
Name: 3, dtype: object

In [ ]:
df.loc[0:5]

    Days  Apple  Banana  Rice  Biscuits  Chips
0  Day 1     52      95    97        29     42
1  Day 2     53      30    22        75     10
2  Day 3     43      42    77         3     91
3  Day 4     56      32    17        73     66
4  Day 5     62       8    45        21     61
5  Day 6     38      34    65        89     37

In [ ]:
df.loc[19]

Days        Day 20
Apple           76
Banana          51
Rice            59
Biscuits        93
Chips           32
Name: 19, dtype: object

In [ ]:
df.loc[[1,2,3]]

    Days  Apple  Banana  Rice  Biscuits  Chips
1  Day 2     53      30    22        75     10
2  Day 3     43      42    77         3     91
3  Day 4     56      32    17        73     66

In [ ]:
df.sum()

Days        Day 1Day 2Day 3Day 4Day 5Day 6Day 7Day 8Day 9D...
Apple                                                    1106
Banana                                                    779
Rice                                                      880
Biscuits                                                 1123
Chips                                                    1002
dtype: object